src/Documents/РасходныйСкладскойОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходныйСкладскойОрдер</Name>
			<Comment>Расходный складской ордер</Comment>
			<BasedOn>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.ПереразмещениеТоваров</xr:Item>
				<xr:Item>Document.ПриходныйСкладскойОрдер</xr:Item>
				<xr:Item>Document.Комплектация</xr:Item>
				<xr:Item>Document.Разукомплектация</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ВводВЭксплуатацию</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровОрдерныйСклад</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецТовара</Name>
					<Comment>Контрагент/склад, получающий товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, с которого отгружаются товары</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Комплектация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереразмещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.Разукомплектация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Таблица товаров и услуг</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазовое</Name>
							<Comment>Количество номенклатуры в базовых единицах (коэффициент=1)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Comment>Место хранения ячеистого склада</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиТоваровОрдерныйСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровОрдерныйСклад</Name>
			<Comment>Остатки товаров на ордерном складе</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Храним ТОЛЬКО в базовых единицах измерения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Comment>Ячейка склада</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Используется только для аналитики. Это НЕ означает, что в ресурс «Количество» пишется в данной единице измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыУчетаЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчетаЕдиницИзмерения</Name>
			<Comment>Виды учета единиц измерения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВедется</Name>
					<Comment>Учет единиц измерения не ведется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедетсяПоПриходу</Name>
					<Comment>Учет единиц измерения ведется по приходу</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедетсяПоПриходуИОтгрузке</Name>
					<Comment>Учет единиц измерения ведется по приходу и отгрузке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрдерныйЯчеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РасходныйСкладскойОрдер/Ext/ObjectModule.bsl
// Модуль документа "Расходный складской ордер"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Переразмещение товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПереразмещениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	
	Для Каждого СтрТовар Из ДанныеЗаполнения.Товары Цикл
		
		НоваяСтрока 							= Товары.Добавить();
		НоваяСтрока.Номенклатура 				= СтрТовар.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрТовар.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения 			= СтрТовар.ЕдиницаИзмеренияНовая;
		НоваяСтрока.Коэффициент 				= СтрТовар.ЕдиницаИзмеренияНовая.Коэффициент;
		НоваяСтрока.Количество 					= ?(СкладКомпании.УчетЕдиницИзмерения = Перечисления.ВидыУчетаЕдиницИзмерения.НеВедется, СтрТовар.Количество, СтрТовар.Количество * СтрТовар.ЕдиницаИзмерения.Коэффициент / СтрТовар.ЕдиницаИзмеренияНовая.Коэффициент);
		НоваяСтрока.КоличествоБазовое 			= СтрТовар.КоличествоБазовоеНовое;
		НоваяСтрока.Ячейка 						= СтрТовар.ЯчейкаНовая;
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПереразмещениеТоваров()

// Производит заполнение объекта на основании документа "Комплектация".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Комплектация(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КомплектацияТовары.НомерСтроки КАК НомерСтроки,
	|	КомплектацияТовары.Номенклатура,
	|	КомплектацияТовары.ХарактеристикаНоменклатуры,
	|	КомплектацияТовары.ЕдиницаИзмерения,
	|	КомплектацияТовары.Коэффициент,
	|	КомплектацияТовары.Количество * КомплектацияТовары.Ссылка.КоличествоКомплектов КАК Количество,
	|	КомплектацияТовары.Количество * КомплектацияТовары.Ссылка.КоличествоКомплектов КАК КоличествоБазовое
	|ИЗ
	|	Документ.Комплектация.Товары КАК КомплектацияТовары
	|ГДЕ
	|	КомплектацияТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
	Выборка	= Запрос.Выполнить().Выбрать();
	Товары.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока 							= Товары.Добавить();
		НоваяСтрока.Номенклатура 				= Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры 	= Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения 			= Выборка.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент 				= Выборка.Коэффициент;
		НоваяСтрока.Количество 					= Выборка.Количество;
		НоваяСтрока.КоличествоБазовое 			= Выборка.КоличествоБазовое;
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Комплектация()

// Производит заполнение объекта на основании документа "Разукомплектация".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Разукомплектация(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	НоваяСтрока 							= Товары.Добавить();
	НоваяСтрока.Номенклатура 				= ДанныеЗаполнения.Комплект;
	НоваяСтрока.ХарактеристикаНоменклатуры 	= ДанныеЗаполнения.ХарактеристикаКомплекта;
	НоваяСтрока.ЕдиницаИзмерения 			= ДанныеЗаполнения.Комплект.ОсновнаяЕдиницаИзмерения;
	НоваяСтрока.Коэффициент 				= ДанныеЗаполнения.Комплект.ОсновнаяЕдиницаИзмерения.Коэффициент;
	НоваяСтрока.Количество 					= ДанныеЗаполнения.КоличествоКомплектов;
	НоваяСтрока.КоличествоБазовое 			= ДанныеЗаполнения.КоличествоКомплектов;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Ячейка) Тогда
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			НоваяСтрока.Ячейка = Справочники.Номенклатура.ПолучитьЯчейкуХранения(НоваяСтрока.Номенклатура, СкладКомпании);
		КонецЕсли;
	Иначе
		НоваяСтрока.Ячейка 					= ДанныеЗаполнения.Ячейка;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Разукомплектация()

// Производит заполнение объекта на основании документа "Пересортица".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Пересортица(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	
	Для Каждого СтрТовар Из ДанныеЗаполнения.Товары Цикл
		
		НоваяСтрока 							= Товары.Добавить();
		НоваяСтрока.Номенклатура 				= СтрТовар.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрТовар.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения 			= СтрТовар.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент 				= СтрТовар.Коэффициент;
		НоваяСтрока.Количество 					= СтрТовар.Количество;
		НоваяСтрока.КоличествоБазовое 			= СтрТовар.Количество;
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Пересортица()

// Производит заполнение объекта на основании документа "Заказ покупателя".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЗаказПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СкладКомпании) Тогда
		СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании", ЭтотОбъект);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЗаказПокупателя()

// Производит заполнение объекта на основании документа "Приходный складской ордер".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПриходныйСкладскойОрдер(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПриходныйСкладскойОрдер()

// Производит заполнение объекта на основании документа "Корректировка реализации".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_КорректировкаРеализации(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
	|	КорректировкаРеализацииТовары.КоличествоРазница КАК Количество,
	|	КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент КАК КоличествоБазовое
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Основание
	|	И КорректировкаРеализацииТовары.КоличествоРазница > 0");
	Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Товары.Очистить();
		Возврат Истина;
	КонецЕсли;
	
	Товары.Загрузить(РезультатЗапроса.Выгрузить());
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПересортицаТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения = "", СтандартнаяОбработка=Истина)
	
	Если ЭтоНовый() Тогда
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения) И ЕстьРеквизит(ДанныеЗаполнения,"СкладКомпании") Тогда
			
			Если ТипЗнч(ДанныеЗаполнения.СкладКомпании) <> Тип("СправочникСсылка.ПодразделенияКомпании")
				И (ДанныеЗаполнения.СкладКомпании.ВидСклада <> Перечисления.ВидыСкладов.Ордерный)
				И (ДанныеЗаполнения.СкладКомпании.ВидСклада <> Перечисления.ВидыСкладов.ОрдерныйЯчеистый) Тогда
				
					ТекстСообщения = НСтр("ru = 'Склад, указанный в документе основании, обычный. Ввод складского ордера невозможен.'");
					УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
				   	Возврат;
			Иначе
				Если ТипЗнч(ДанныеЗаполнения.СкладКомпании) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
					
					ТекстСообщения = НСтр("ru = 'В поле ""Отправитель"" указано Подразделение компании. Ввод складского ордера невозможен.'");
					УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ВычетыТЧВыполнены = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ПереразмещениеТоваров") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Комплектация") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Разукомплектация")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересортицаТоваров") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВводВЭксплуатацию") Тогда
		ВычетыТЧВыполнены = Истина;
	КонецЕсли;
	
	Если НЕ ВычетыТЧВыполнены И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Документы.РасходныйСкладскойОрдер.ЗаполнитьТабличнуюЧастьПоОснованию(ЭтотОбъект, ДанныеЗаполнения, Ложь);
	КонецЕсли;
	
	Если ЕстьРеквизит(ДанныеЗаполнения, "Контрагент") И ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) Тогда
		ВладелецТовара = ДанныеЗаполнения.Контрагент;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.КоличествоБазовое = 0 Тогда
			СтрокаТЧ.КоличествоБазовое	= СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент;
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого СтрТовар Из Товары Цикл
		Если СтрТовар.Коэффициент = 0 Тогда
			СтрТовар.Коэффициент = ?(НЕ ЗначениеЗаполнено(СтрТовар.ЕдиницаИзмерения), 1, СтрТовар.ЕдиницаИзмерения.Коэффициент);
		КонецЕсли;	
	КонецЦикла;	
	
	// Произведем свертку.
	Товары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество, КоличествоБазовое");
	
	Если Товары.Количество() > 0 И СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.ОрдерныйЯчеистый Тогда
		
		ВедетсяУчетЕдиниц               = СкладКомпании.УчетЕдиницИзмерения <> Перечисления.ВидыУчетаЕдиницИзмерения.НеВедется;
		ТочныйПоискПоЕдиницам           = СкладКомпании.УчетЕдиницИзмерения = Перечисления.ВидыУчетаЕдиницИзмерения.ВедетсяПоПриходуИОтгрузке;
		ПредпочтительныйПоискПоЕдиницам = СкладКомпании.УчетЕдиницИзмерения = Перечисления.ВидыУчетаЕдиницИзмерения.ВедетсяПоПриходу;
		
		Запрос = Новый Запрос();
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОрдерныйСкладОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ОстаткиТоваровОрдерныйСкладОстатки.Ячейка КАК Ячейка,
		|	ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.Ячейка.КоординатаX, 0) КАК КоординатаX,
		|	ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.Ячейка.КоординатаY, 0) КАК КоординатаY,
		|	ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.Ячейка.Уровень, 0) КАК Уровень" + ?(ВедетсяУчетЕдиниц,",
		|	ОстаткиТоваровОрдерныйСкладОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОстаткиТоваровОрдерныйСкладОстатки.ЕдиницаИзмерения.Коэффициент КАК Коэффициент", "") + ",
		|	ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток КАК Количество
		|ИЗ 
		|	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(, СкладКомпании = &СкладКомпании И Номенклатура В (&Номенклатура)) КАК ОстаткиТоваровОрдерныйСкладОстатки
		|";
		
		Запрос.Текст 	= ТекстЗапроса;
		Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		ТаблицаОстатков.Индексы.Добавить("Номенклатура");
		
		Если ТочныйПоискПоЕдиницам Тогда
			ТаблицаОстатков.Индексы.Добавить("ЕдиницаИзмерения");
		КонецЕсли;
		
		ТаблицаЯчеек = Новый ТаблицаЗначений;
		ТаблицаЯчеек.Колонки.Добавить("Кратность");
		ТаблицаЯчеек.Колонки.Добавить("РасстояниеДоВхода");
		ТаблицаЯчеек.Колонки.Добавить("СтрокаОстаткаЯчейки");
		
		ТоварыДляЗаполнения = Товары.ВыгрузитьКолонки();
		ТоварыДляЗаполнения.Колонки.Добавить("РасстояниеДоВхода", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		
		НачалоОтрезкаX = СкладКомпании.ВходX;
		НачалоОтрезкаY = СкладКомпании.ВходY;
		НачалоОтрезкаZ = СкладКомпании.ВходУровень;
		
		Для Каждого СтрТовар Из Товары Цикл
			
			СтрТовар.Ячейка = "";
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", СтрТовар.Номенклатура);
			
			Если ТочныйПоискПоЕдиницам Тогда
				Отбор.Вставить("ЕдиницаИзмерения", СтрТовар.ЕдиницаИзмерения);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрТовар.ХарактеристикаНоменклатуры) Тогда
				Отбор.Вставить("ХарактеристикаНоменклатуры", СтрТовар.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			МассивСтрок = ТаблицаОстатков.НайтиСтроки(Отбор);
			
			ТаблицаЯчеек.Очистить();
			
			Для Каждого СтрОстаток Из МассивСтрок Цикл
				
				Кратность = 0;
				Если ПредпочтительныйПоискПоЕдиницам Тогда
					Если СтрТовар.ЕдиницаИзмерения = СтрОстаток.ЕдиницаИзмерения Тогда
						Кратность = 2;
					Иначе
						Если СтрТовар.Коэффициент > СтрОстаток.Коэффициент Тогда
							Кратность = СтрОстаток.Коэффициент/СтрТовар.Коэффициент;
						Иначе
							Кратность = СтрТовар.Коэффициент/СтрОстаток.Коэффициент;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ДлиннаОтрезкаПоX = СтрОстаток.КоординатаX - НачалоОтрезкаX;
				ДлиннаОтрезкаПоY = СтрОстаток.КоординатаY - НачалоОтрезкаY;
				ДлиннаОтрезкаПоZ = СтрОстаток.Уровень     - НачалоОтрезкаZ;
				
				РасстояниеДоВхода = Sqrt((ДлиннаОтрезкаПоX*ДлиннаОтрезкаПоX) + (ДлиннаОтрезкаПоY*ДлиннаОтрезкаПоY) + (ДлиннаОтрезкаПоZ*ДлиннаОтрезкаПоZ));
				
				НоваяСтрока = ТаблицаЯчеек.Добавить();
				НоваяСтрока.СтрокаОстаткаЯчейки = СтрОстаток;
				НоваяСтрока.Кратность           = Кратность;
				НоваяСтрока.РасстояниеДоВхода   = РасстояниеДоВхода;
				
			КонецЦикла;
			
			Если ТаблицаЯчеек.Количество() > 0 Тогда
				
				СтрокаСортировки = "";
				Если ПредпочтительныйПоискПоЕдиницам Тогда
					СтрокаСортировки = СтрокаСортировки + "Кратность Убыв,";
				КонецЕсли;
				СтрокаСортировки = СтрокаСортировки + "РасстояниеДоВхода Возр";
				ТаблицаЯчеек.Сортировать(СтрокаСортировки);
				
				ОсталосьРаспределить = СтрТовар.КоличествоБазовое;
				Для Каждого СтрокаЯчейки Из ТаблицаЯчеек Цикл
					
					ТекЯчейка = СтрокаЯчейки.СтрокаОстаткаЯчейки;
					
					Если ОсталосьРаспределить = 0 Тогда
						Прервать;
					КонецЕсли;
					
					Если ТекЯчейка.Количество = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					КоличествоСтроки = Мин(ОсталосьРаспределить, ТекЯчейка.Количество);
					
					НоваяСтрока = ТоварыДляЗаполнения.Добавить();
					НоваяСтрока.Номенклатура               = СтрТовар.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры = ТекЯчейка.ХарактеристикаНоменклатуры;
					Если ВедетсяУчетЕдиниц Тогда
						НоваяСтрока.ЕдиницаИзмерения       = ТекЯчейка.ЕдиницаИзмерения;
						НоваяСтрока.Коэффициент            = ТекЯчейка.Коэффициент;
						НоваяСтрока.Количество             = ?(ТекЯчейка.Коэффициент>0,Окр(КоличествоСтроки/ТекЯчейка.Коэффициент, 3, 1), КоличествоСтроки);
					Иначе
						НоваяСтрока.ЕдиницаИзмерения       = СтрТовар.ЕдиницаИзмерения;
						НоваяСтрока.Коэффициент            = СтрТовар.Коэффициент;
						НоваяСтрока.Количество             = ?(СтрТовар.Коэффициент>0,Окр(КоличествоСтроки/СтрТовар.Коэффициент, 3, 1), КоличествоСтроки);
					КонецЕсли;
					НоваяСтрока.Ячейка                     = ТекЯчейка.Ячейка;
					НоваяСтрока.КоличествоБазовое          = КоличествоСтроки;
					НоваяСтрока.РасстояниеДоВхода          = СтрокаЯчейки.РасстояниеДоВхода;
					
					Если КоличествоСтроки = ТекЯчейка.Количество Тогда
						ТаблицаОстатков.Удалить(ТекЯчейка);
					Иначе
						ТекЯчейка.Количество = ТекЯчейка.Количество - КоличествоСтроки;
					КонецЕсли;
					
					ОсталосьРаспределить = ОсталосьРаспределить - КоличествоСтроки;
					
				КонецЦикла;
				
				Если ОсталосьРаспределить > 0 Тогда
					НоваяСтрока = ТоварыДляЗаполнения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТовар);
					НоваяСтрока.КоличествоБазовое = ОсталосьРаспределить;
					НоваяСтрока.Количество        = ?(НоваяСтрока.Коэффициент>0,Окр(ОсталосьРаспределить/НоваяСтрока.Коэффициент, 3, 1), ОсталосьРаспределить);
					НоваяСтрока.РасстояниеДоВхода = 999999999999;
				КонецЕсли;
				
			Иначе
				НоваяСтрока = ТоварыДляЗаполнения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТовар);
				НоваяСтрока.РасстояниеДоВхода = 999999999999;
			КонецЕсли;
			
		КонецЦикла;
		
		ТоварыДляЗаполнения.Сортировать("РасстояниеДоВхода");
		Товары.Загрузить(ТоварыДляЗаполнения);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// На всякий случай проверим тип склада, его могли поменять в самом справочнике.
	Если СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Обычный 
		ИЛИ СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
		
		Отказ = Истина;
		ВывестиСообщение(НСтр("ru='Склад документа имеет вид'") + " " + СкладКомпании.ВидСклада 
			+ """. " + НСтр("ru = 'Проведение возможно только для ""Ордерного"" или ""Ордерного и ячеистого"" склада.'"), ЭтотОбъект);
		Возврат;
	КонецЕсли; 
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Корректируем количество базовое. 
	Для Каждого Строка Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.КоличествоБазовое) Тогда
			Строка.КоличествоБазовое = Строка.Количество * Строка.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоОрдерномуУчетуПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// На всякий случай проверим тип склада, его могли поменять в самом справочнике
	Если СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Обычный 
		ИЛИ СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Склад документа имеет вид <%1>. Проведение возможно только для ""Ордерного"" или ""Ордерного и ячеистого"" склада.'"),СкладКомпании.ВидСклада);
		ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,, Отказ);
	КонецЕсли; 
	
	// Вызываем общий обработчик события.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	СписокТоваров = Товары.ВыгрузитьКолонку("Номенклатура");
	
	// Проведем остатки товаров по регистру ОстаткиТоваровОрдерныйСклад.
	НаборЗаписейОстатки = Движения.ОстаткиТоваровОрдерныйСклад;
	НаборЗаписейОстатки.РежимПроведения = РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект  = ЭтотОбъект;
	НаборЗаписейОстатки.СкладКомпании   = СкладКомпании;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам = Неопределено;
	НаборЗаписейОстатки.Приходовать     = Истина;
	НаборЗаписейОстатки.ПоБазовомуКоличеству = Истина;
	Отказ = НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	
	// Двигаем границу последовательности ордерного склада.
	РаботаСГраницами.СдвинутьГраницуОрдерногоУчета(Ссылка, ДополнительныеСвойства, Движения);
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
